weitat95/IoTEmbedded/RTOS_TM4C123_LifiTransmitter/ST7735.c
  line = 0x01;        // print the top row first
  // print the rows, starting at the top
  for(row=0; row<8; row=row+1){
    for(i=0; i<size; i=i+1){
      // print the columns, starting on the left
      for(col=0; col<5; col=col+1){
        if(Font[(c*5)+col]&line){
          // bit is set in Font, print pixel(s) in text color
          for(j=0; j<size; j=j+1){
            pushColor(textColor);
          }
        } else{
          // bit is cleared in Font, print pixel(s) in background color
          for(j=0; j<size; j=j+1){
            pushColor(bgColor);
          }
        }
      }
      // print blank column(s) to the right of character
      for(j=0; j<size; j=j+1){
        pushColor(bgColor);
      }
    }
    line = line<<1;   // move up to the next row
  }
}
//------------ST7735_OutString------------
// String draw function.  
// 16 rows (0 to 15) and 21 characters (0 to 20)
// Requires (11 + size*size*6*8) bytes of transmission for each character
// Input: x         columns from the left edge (0 to 20)
//        y         rows from the top edge (0 to 15)
//        pt        pointer to a null terminated string to be printed
//        textColor 16-bit color of the characters
// bgColor is Black and size is 1
// Output: number of characters printed
unsigned long ST7735_OutString(unsigned short x, unsigned short y, char *pt, short textColor){
  unsigned long count = 0;
  if(y>15) return 0;
  while(*pt){
    ST7735_DrawCharS(x*6, y*10, *pt, textColor, ST7735_BLACK, 1);
    pt++;
    x = x+1;
    if(x>20) return count;  // number of characters printed
    count++;
  }
  return count;  // number of characters printed
}
//-----------------------fillmessage-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
char Message[12];
unsigned long Messageindex;
unsigned long Cursor;
unsigned long StLine;
void fillmessage(unsigned long n){
// This function uses recursion to convert decimal number
//   of unspecified length as an ASCII string
  if(n >= 10){
    fillmessage(n/10);
    n = n%10;
  }
  Message[Messageindex] = (n+'0'); /* n is between 0 and 9 */
  if(Messageindex<11)Messageindex++;
}
//-----------------------ST7735_OutUDec-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
void ST7735_OutUDec(unsigned long n){
  Messageindex = 0;
  fillmessage(n);
  Message[Messageindex] = 0; // terminate
  ST7735_OutString(Cursor,StLine,Message,ST7735_YELLOW);
}

//-----------------------ST7735_OutUDec2-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
void ST7735_OutUDec2(unsigned long n, unsigned long l){
  Messageindex = 0;
  fillmessage(n);
  while(Messageindex<5){
    Message[Messageindex++] = 32; // fill space
  }
  Message[Messageindex] = 0; // terminate
  ST7735_OutString(14,l,Message,ST7735_YELLOW);
}
//------------ST7735_Message------------
// String draw and number output.  
// Input: device  0 is on top, 1 is on bottom
//        line    row from top, 0 to 7 for each device
//        pt      pointer to a null terminated string to be printed
//        value   signed integer to be printed
void ST7735_Message (unsigned long d, unsigned long l, char *pt, long value){
  unsigned long sl = 8*d+l;
  OS_Wait(&LCDFree);
  ST7735_OutString(0,sl,pt,ST7735_YELLOW);
  ST7735_OutUDec2(value,sl);
  OS_Signal(&LCDFree);
}


#define MADCTL_MY  0x80
#define MADCTL_MX  0x40
#define MADCTL_MV  0x20
#define MADCTL_ML  0x10
#define MADCTL_RGB 0x00
#define MADCTL_BGR 0x08
#define MADCTL_MH  0x04

//------------ST7735_SetRotation------------
// Change the image rotation.
// Requires 2 bytes of transmission
// Input: m new rotation value (0 to 3)
// Output: none
void ST7735_SetRotation(unsigned char m) {

  writecommand(ST7735_MADCTL);
  Rotation = m % 4; // can't be higher than 3
  switch (Rotation) {
   case 0:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MX | MADCTL_MY | MADCTL_RGB);
     } else {
       writedata(MADCTL_MX | MADCTL_MY | MADCTL_BGR);
     }
     _width  = ST7735_TFTWIDTH;
     _height = ST7735_TFTHEIGHT;
     break;
   case 1:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MY | MADCTL_MV | MADCTL_RGB);
     } else {
       writedata(MADCTL_MY | MADCTL_MV | MADCTL_BGR);
     }
     _width  = ST7735_TFTHEIGHT;
     _height = ST7735_TFTWIDTH;
     break;
  case 2:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_RGB);
     } else {
       writedata(MADCTL_BGR);
     }
     _width  = ST7735_TFTWIDTH;
     _height = ST7735_TFTHEIGHT;
    break;
   case 3:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MX | MADCTL_MV | MADCTL_RGB);
     } else {
       writedata(MADCTL_MX | MADCTL_MV | MADCTL_BGR);
     }
     _width  = ST7735_TFTHEIGHT;
     _height = ST7735_TFTWIDTH;
     break;
  }
}


//------------ST7735_InvertDisplay------------
// Send the command to invert all of the colors.
// Requires 1 byte of transmission
// Input: i 0 to disable inversion; non-zero to enable inversion
// Output: none
void ST7735_InvertDisplay(int i) {
  if(i){
    writecommand(ST7735_INVON);
  } else{
    writecommand(ST7735_INVOFF);
  }
}
//RealTime printing on Screen, Maximum 21 characters on a line.
uint8_t line=0; //max 16 lines
uint8_t chars=0; //max 21 characters per line [0,20
char *token;
uint8_t status=0;
void ST7735_AcceptText(char * pt){
	char strings[32];
	strcpy(strings,pt);
	if(status==0){
	if(strings[0]==' '){
		ST7735_OutString(chars,line," ",ST7735_WHITE);
		chars++;
	}
	token =  strtok(strings," ");
	while(token!=NULL){
		uint8_t length= strlen(token);
		
		if(length>21){
			
		}else{
			if(chars+length<=21){
				ST7735_OutString(chars,line,token, ST7735_WHITE);
				chars+=length;
			}else{
				line++;
				chars=0;
				if(line>=16){
					line=0;
				}
				ST7735_OutString(0,line,"                     ",ST7735_WHITE);
				ST7735_OutString(chars,line,token,ST7735_WHITE);
				chars+=length;
			}
		}
		token = strtok(NULL, " ");
		if(token!=NULL){
			ST7735_OutString(chars,line," ",ST7735_WHITE);
			chars++;
		}
	}
	}
}

void ST7735_ClearResetText(void){
	status=1;
	ST7735_FillScreen(ST7735_BLACK);
	chars=0;
	line=0;
	status=0;
}